
## Plan Result (management/base_apne1)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2937084828)


<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.deploy-role.aws_iam_policy.this
  * module.deploy-role.aws_iam_role.this
  * module.oidc-github-actions-id-provider.aws_iam_openid_connect_provider.this
  * module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket.this
  * module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_public_access_block.this
  * module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_versioning.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.deploy-role.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "management-private-lab-deploy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:*",
                          + "apigateway:*",
                          + "ec2:*",
                          + "rds:*",
                          + "s3:*",
                          + "sns:*",
                          + "states:*",
                          + "ssm:*",
                          + "sqs:*",
                          + "iam:*",
                          + "elasticloadbalancing:*",
                          + "autoscaling:*",
                          + "cloudwatch:*",
                          + "cloudfront:*",
                          + "route53:*",
                          + "ecr:*",
                          + "logs:*",
                          + "ecs:*",
                          + "application-autoscaling:*",
                          + "events:*",
                          + "elasticache:*",
                          + "es:*",
                          + "kms:*",
                          + "dynamodb:*",
                          + "kinesis:*",
                          + "firehose:*",
                          + "elasticbeanstalk:*",
                          + "cloudformation:*",
                          + "acm:*",
                          + "organizations:*",
                          + "sso:*",
                          + "identitystore:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSpecifics"
                    },
                  + {
                      + Action   = [
                          + "iam:*Login*",
                          + "iam:*Group*",
                          + "aws-portal:*",
                          + "budgets:*",
                          + "config:*",
                          + "directconnect:*",
                          + "aws-marketplace:*",
                          + "aws-marketplace-management:*",
                          + "ec2:*ReservedInstances*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenySpecifics"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/base_apne1"
        }
    }

  # module.deploy-role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:tqer39/private-lab:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::577523824419:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::577523824419:role/management-private-lab-deploy"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "management-private-lab-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/base_apne1"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.oidc-github-actions-id-provider.aws_iam_openid_connect_provider.this will be created
  + resource "aws_iam_openid_connect_provider" "this" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/base_apne1"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/management/base_apne1"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.tfstate-s3-bucket.module.s3-bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":143,"Program":"tfcmt","SHA1":"c9de3ae3e711b7cd4b61034bd5239459c5508ee2","Target":"management/base_apne1","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->